import random

def гра():
    варіанти = ["Камінь", "Ножиці", "Папір"]
    
    гравець = input("Оберіть один із: Камінь, Ножиці, Папір: ")
    компьютер = random.choice(варіанти)
    
    print(f"Ви обрали: {гравець}")
    print(f"Комп'ютер обрав: {компьютер}")
    
    if гравець == компьютер:
        результат = "Нічия!"
    elif (гравець == "Камінь" and компьютер == "Ножиці") or (гравець == "Ножиці" and компьютер == "Папір") or (гравець == "Папір" and компьютер == "Камінь"):
        результат = "Ви перемогли!"
    else:
        результат = "Комп'ютер переміг!"

    print(результат)

гра()
